# Ex3 - Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [26]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset

In [27]:
pd.read_csv("users_data.csv")

,user_id,age,gender,occupation,zip_code
0,1,24.0,M,technician,85711.0
1,2,53.0,F,other,94043.0
2,3,23.0,M,writer,32067.0
3,4,24.0,M,technician,43537.0
4,5,33.0,F,other,15213.0
5,6,42.0,M,executive,98101.0
6,7,57.0,M,administrator,91344.0
7,8,36.0,M,administrator,5201.0
8,9,29.0,M,student,1002.0
9,10,53.0,M,lawyer,90703.0
10,... (truncated for brevity; assuming full data...,NaN,NaN,NaN,NaN
11,500,28.0,M,administrator,94305.0

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [28]:
df = pd.read_csv("users_data.csv", index_col="user_id")

### Step 4. See the first 25 entries

In [29]:
df.head(25)

,age,gender,occupation,zip_code
user_id,,,,
1,24.0,M,technician,85711.0
2,53.0,F,other,94043.0
3,23.0,M,writer,32067.0
4,24.0,M,technician,43537.0
5,33.0,F,other,15213.0
6,42.0,M,executive,98101.0
7,57.0,M,administrator,91344.0
8,36.0,M,administrator,5201.0
9,29.0,M,student,1002.0
10,53.0,M,lawyer,90703.0
... (truncated for brevity; assuming full dataset was provided),NaN,NaN,NaN,NaN
500,28.0,M,administrator,94305.0

### Step 5. See the last 10 entries

In [30]:
df.tail(10)

,age,gender,occupation,zip_code
user_id,,,,
3,23.0,M,writer,32067.0
4,24.0,M,technician,43537.0
5,33.0,F,other,15213.0
6,42.0,M,executive,98101.0
7,57.0,M,administrator,91344.0
8,36.0,M,administrator,5201.0
9,29.0,M,student,1002.0
10,53.0,M,lawyer,90703.0
... (truncated for brevity; assuming full dataset was provided),NaN,NaN,NaN,NaN
500,28.0,M,administrator,94305.0

### Step 6. What is the number of observations in the dataset?

In [31]:
df.shape[0]

12

### Step 7. What is the number of columns in the dataset?

In [32]:
df.shape[1]

4

### Step 8. Print the name of all the columns.

In [33]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [34]:
df.index

Index(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10',
       '... (truncated for brevity; assuming full dataset was provided)',
       '500'],
      dtype='object', name='user_id')

### Step 10. What is the data type of each column?

In [35]:
df.dtypes

age           float64
gender         object
occupation     object
zip_code      float64
dtype: object

### Step 11. Print only the occupation column

In [42]:
df.occupation

user_id
1                                                                     technician
2                                                                          other
3                                                                         writer
4                                                                     technician
5                                                                          other
6                                                                      executive
7                                                                  administrator
8                                                                  administrator
9                                                                        student
10                                                                        lawyer
... (truncated for brevity; assuming full dataset was provided)              NaN
500                                                                administrator
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [37]:
len(df.occupation.unique())

8

In [40]:
df.occupation.unique().size

8

In [17]:
df.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', nan], dtype=object)

### Step 13. What is the most frequent occupation?

In [19]:
df.occupation.value_counts().reset_index()

      occupation  count
0  administrator      3
1     technician      2
2          other      2
3         writer      1
4      executive      1
5        student      1
6         lawyer      1

### Step 14. Summarize the DataFrame.

In [20]:
df.describe()

             age      zip_code
count  11.000000     11.000000
mean   36.545455  59202.454545
std    12.769993  39884.178451
min    23.000000   1002.000000
25%    26.000000  23640.000000
50%    33.000000  85711.000000
75%    47.500000  92693.500000
max    57.000000  98101.000000

### Step 15. Summarize all the columns

In [21]:
df.describe(include="all")

              age gender     occupation      zip_code
count   11.000000     11             11     11.000000
unique        NaN      2              7           NaN
top           NaN      M  administrator           NaN
freq          NaN      9              3           NaN
mean    36.545455    NaN            NaN  59202.454545
std     12.769993    NaN            NaN  39884.178451
min     23.000000    NaN            NaN   1002.000000
25%     26.000000    NaN            NaN  23640.000000
50%     33.000000    NaN            NaN  85711.000000
75%     47.500000    NaN            NaN  92693.500000
max     57.000000    NaN            NaN  98101.000000

### Step 16. Summarize only the occupation column

In [22]:
df.occupation.describe()

count                11
unique                7
top       administrator
freq                  3
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [47]:
round(df.age.mean(), 2)

36.55

### Step 18. What is the age with least occurrence?

In [52]:
df.age.value_counts().sort_values().head(1)

age
23.0    1
Name: count, dtype: int64